import { useIsMobile } from "../ink";
import RdtSpan from "../RdtSpan";

export const JournalContentSideButtons = () => {
  const IS_MOBILE = useIsMobile();

  return (
    <section className="flex flex-col gap-[20px] items-end">
      {!IS_MOBILE && (
        <button onClick={() => alert("관심상품")}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
          >
            <path
              d="M8.57337 5.28516C9.83623 5.28516 11.0683 5.84624 11.9718 6.81733C11.9923 6.83891 12.0129 6.83891 12.0334 6.81733C12.9369 5.85703 14.1587 5.28516 15.4318 5.28516C15.5859 5.28516 15.7296 5.28516 15.8836 5.30674C20.4525 5.80308 20.9351 11.5433 18.7173 13.6582L13.1012 18.8482C12.4646 19.4308 11.5201 19.4308 10.8938 18.8482L5.2776 13.6582C3.07016 11.5433 3.54245 5.80308 8.12161 5.30674C8.27562 5.28516 8.42963 5.28516 8.57337 5.28516Z"
              stroke="#CCCCCC"
              stroke-width="1.5"
              stroke-miterlimit="10"
            />
          </svg>
        </button>
      )}
      <section
        className={`${
          IS_MOBILE ? "flex-row absolute bottom-[78px]" : "flex-col"
        } flex gap-[6px]`}
      >
        {IS_MOBILE ? (
          <>
            <button
              onClick={() => alert("관심상품")}
              className="border border-[#CCCCCC] flex items-center justify-center w-[30px] h-[30px] rounded-[50px]"
            >
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="14"
                height="14"
                viewBox="0 0 14 14"
                fill="none"
              >
                <path
                  d="M4.09379 2.32056C3.99489 2.32056 3.90272 2.32523 3.80834 2.33522C2.25904 2.49354 1.6284 3.4507 1.37217 4.22579C0.995358 5.36567 1.24739 6.71624 1.95819 7.37215L6.73191 11.572C6.83321 11.6608 6.94154 11.6795 7.01458 11.6795C7.08762 11.6795 7.19596 11.6608 7.29627 11.5728L12.071 7.37215C12.7818 6.71624 13.0338 5.36567 12.657 4.22579C12.4008 3.4507 11.7701 2.49354 10.2172 2.33484C10.1264 2.32523 10.0343 2.32056 9.93536 2.32056C9.1389 2.32056 8.34303 2.66403 7.74936 3.26538C7.55654 3.45935 7.28872 3.57059 7.01457 3.57059C6.74043 3.57059 6.47261 3.45935 6.27698 3.26255C5.68658 2.6639 4.89083 2.32056 4.09379 2.32056ZM4.09379 1.32056C5.17385 1.32056 6.21772 1.77834 6.98897 2.56036C7.00253 2.57401 7.02662 2.574 7.04018 2.56036C7.81219 1.77834 8.85455 1.32056 9.93536 1.32056C10.0641 1.32056 10.1929 1.32668 10.3225 1.3404C14.2194 1.73861 14.6231 6.3948 12.7394 8.11602L7.9568 12.3236C7.416 12.7981 6.61316 12.7981 6.07237 12.3236L1.28977 8.11602C-0.593897 6.3948 -0.190186 1.73861 3.70668 1.3404C3.83622 1.32668 3.96502 1.32056 4.09379 1.32056Z"
                  fill="black"
                />
              </svg>
            </button>
            <button
              onClick={() => alert("장바구니")}
              className="border border-[#CCCCCC] flex items-center justify-center w-[30px] h-[30px] rounded-[50px]"
            >
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="14"
                height="13"
                viewBox="0 0 14 13"
                fill="none"
              >
                <path
                  d="M1.13672 0.495854L1.90912 0.495854C2.13226 0.495156 2.34872 0.571693 2.52185 0.712481C2.69497 0.853268 2.81409 1.04963 2.8589 1.26823L3.99983 7.40903C4.04464 7.62763 4.1637 7.82399 4.33682 7.96477C4.50995 8.10556 4.72646 8.1821 4.94961 8.1814H11.4511C11.6662 8.18181 11.8753 8.11051 12.0453 7.9788C12.2154 7.84709 12.3367 7.66247 12.3901 7.45411L13.3585 3.13055C13.3937 2.98836 13.396 2.84003 13.3652 2.69682C13.3344 2.55361 13.2713 2.41932 13.1808 2.30419C13.0902 2.18905 12.9745 2.09608 12.8426 2.0324C12.7107 1.96872 12.566 1.936 12.4195 1.93671H6.03759"
                  stroke="black"
                  stroke-width="0.9625"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />
                <path
                  d="M5.54658 12.258C6.08791 12.258 6.52675 11.8191 6.52675 11.2778C6.52675 10.7364 6.08791 10.2976 5.54658 10.2976C5.00524 10.2976 4.56641 10.7364 4.56641 11.2778C4.56641 11.8191 5.00524 12.258 5.54658 12.258Z"
                  stroke="black"
                  stroke-width="0.9625"
                  stroke-miterlimit="10"
                />
                <path
                  d="M10.9392 12.258C11.4805 12.258 11.9193 11.8191 11.9193 11.2778C11.9193 10.7364 11.4805 10.2976 10.9392 10.2976C10.3978 10.2976 9.95898 10.7364 9.95898 11.2778C9.95898 11.8191 10.3978 12.258 10.9392 12.258Z"
                  stroke="black"
                  stroke-width="0.9625"
                  stroke-miterlimit="10"
                />
              </svg>
            </button>
          </>
        ) : (
          <>
            <button
              onClick={() => alert("장바구니")}
              className="w-[100px] h-[38px] flex items-center justify-center rounded-[8px] bg-[#767676]"
            >
              <RdtSpan type="B2" weight="Medium" color="#FFFFFF">
                장바구니
              </RdtSpan>
            </button>
            <button
              onClick={() => alert("신청하기")}
              className="w-[100px] h-[38px] flex items-center justify-center rounded-[8px] bg-[#F4430C]"
            >
              <RdtSpan type="B2" weight="Medium" color="#FFFFFF">
                신청하기
              </RdtSpan>
            </button>
          </>
        )}
      </section>
    </section>
  );
};
